Revit 2026 API

# GenericGenericBumpMap Property

---

The property labeled "Bump" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericBumpMap { get; }
```
```vb
Public Shared ReadOnly Property GenericBumpMap As String
	Get
```
```cpp
public:
static property String^ GenericBumpMap {
	String^ get ();
}
```
```fsharp
static member GenericBumpMap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace